In [1]:
%%capture

!curl https://www.sqlite.org/src/tarball/sqlite.tar.gz?r=release | tar xz
%cd sqlite/
!./configure
!make sqlite3.c
%cd /content
!npx degit coleifer/pysqlite3 -f
!cp sqlite/sqlite3.[ch] .
!python setup.py build_static build
!cp build/lib.linux-x86_64-3.7/pysqlite3/_sqlite3.cpython-37m-x86_64-linux-gnu.so \
     /usr/lib/python3.7/lib-dynload/

### Перезапустить среду выполнения!

In [1]:
import sqlite3
sqlite3.sqlite_version

'3.35.4'

In [2]:
import pandas as pd
import numpy as np

In [3]:
con = sqlite3.connect('db')
cur = con.cursor()
def select(sql):
  return pd.read_sql(sql,con)

In [4]:
sql = """CREATE TABLE IF NOT EXISTS test(userid INT PRIMARY KEY,fname TEXT,lname TEXT);
INSERT INTO test (userid, fname, lname) VALUES('1','Иван','Иванов');
INSERT INTO test (userid, fname, lname) VALUES('2','Петр','Петров');
"""

In [5]:
cur.executescript(sql)

In [6]:
sql = '''select * from test'''

In [7]:
select(sql)

   userid fname   lname
0       1  Иван  Иванов
1       2  Петр  Петров

In [8]:
def string_upper(value):
    return value.upper()

In [9]:
con.create_function("string_upper", 1, string_upper)

In [12]:
sql = '''select userid, 
         string_upper(fname) as fname, 
         string_upper(lname) as lname
         from test'''

In [13]:
select(sql)

   userid fname   lname
0       1  ИВАН  ИВАНОВ
1       2  ПЕТР  ПЕТРОВ